Version2/Cats99/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
  def new
    @cats = Cat.all

INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 2], ["created_at", "2014-10-29 20:52:15.043548"], ["end_date", "2014-11-02"], ["start_date", "2014-11-01"], ["updated_at", "2014-10-29 20:52:15.043548"], ["user_id", 1]]
SELECT "cats".* FROM "cats"
---
  def create
    @cat_rental_request = CatRentalRequest.new(request_params)
    @cat_rental_request.user_id = current_user.id
    if @cat_rental_request.save
      redirect_to cat_url(@cat_rental_request.cat)
    else
      @cats = Cat.all

SELECT "cat_rental_requests".* FROM "cat_rental_requests"  WHERE (      ('2014-12-11' BETWEEN start_date AND end_date)
---
  def approve
    request = CatRentalRequest.find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", 3]]
---
  def deny
    request = CatRentalRequest.find(params[:id])