Version2/Cats99/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "user_name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."user_id" = $1  [["user_id", 1]]
---
  def show # Showing your cat rentals
    @user = current_user
    @cat_rental_requests = @user.cat_rental_requests
    @logged_in_useragents = []
    Session.where(user_id: @user.id).each do |sesh|